Revit 2024 API
ExporterIFC.WallAndColumnSplitting Property
 Identifies if division of multi-level walls and columns by levels should take place during this export.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool WallAndColumnSplitting { get; }
Visual Basic
Public ReadOnly Property WallAndColumnSplitting As Boolean
	Get
Visual C++
public:
property bool WallAndColumnSplitting {
	bool get ();
}
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace